# Користувач вводить імена людей, поки не введе порожній
# рядок. Збережіть усі імена в множині. Якщо ім’я вводиться
# повторно, то вивести повідомлення про це.
# Виведіть кількість людей
#
# names = set()
# total = 0
#
# while True:
#     name = input("Введіть ім'я людей")
#     if name == '':
#         break
#
#     if name in names:
#         print("Таке ім'я вже є")
#
#     else:
#         names.add(name)
#         total += 1
#
# print(names)
# print(total)
# Студентів розбили на 2 групи, кожна з яких навчається у
# свій день. Перевірте чи не виникло помилки, а саме
#  Чи немає студентів які є в двох групах одночасно(якщо
# є, то вивести їх імена)
#  Чи немає студентів, про яких забули(якщо є, то вивести
# імена)
# Напишіть відповідну функцію, яка отримує два списки з
# іменами студентів кожної групи, та список усіх студентів.
# Додатково: змініть код, якщо груп 3

# def students_check(students, group1, group2):
#     students = set(students)
#     group1 = set(group1)
#     group2 = set(group2)
#
#     both = group1 & group2
#     print(f"Студенти в обох групах:", both)
#     missing_students = students - (group1.union(group2))
#     print(f"{missing_students}")
#
#
# group1 = ["Іван", "Марія", "Петро"]
# group2 = ["Олег", "Марія", "Анна"]
# students = ["Іван", "Марія", "Петро", "Олег", "Анна", "Сергій"]
#
# students_check(students, group1, group2)

# Є словник з цінами продуктів, де ключ – назва продукту, а
# значення – ціна за кг. Організуйте просту роботу магазину:
# користувач вводить назву продукту та вагу, потрібно вивести
# загальну ціну.

#
# prices = {
#     "яблука": 35,
#     "банани": 50,
#     "картопля": 20,
#     "помідори": 60,
#     "огірки": 55,
#     "морква": 18,
#     "цибуля": 22
# }
#
# name = input("Введіть назву товару").lower()
# weight = int(input("Введіть вагу у кг"))
# if name in prices:
#     price = prices[name] * weight
#     print(f"Ціна за всі товари {price:.2f}")


# Є словник з інформацією про вміст вітаміну С в різних
# продуктах, де ключ – назва продукту, значення – вміст
# вітаміну С у мг. Користувач вводить свій раціон: список з
# назвами продуктів
# Обчисліть вміст вітаміну С в раціоні(якщо у словнику
# немає якогось продукту, вважайте вміст вітаміну рівним 0 мг).
# Виведіть продукт з найбільшим вмістом вітаміну С.


vitamin_c = {
    "шипшина": 426,
    "червоний перець": 190,
    "чорна смородина": 181,
    "ківі": 93,
    "броколі": 89,
    "брюссельська капуста": 85,
    "полуниця": 59,
    "апельсин": 53,
    "лимон": 53,
    "ананас": 48,
    "манго": 36,
    "шпинат": 28,
    "мандарин": 27,
    "помідор": 23,
}

diet = input("Введіть продукти через кому: ").lower().split(",")

total = 0

for product in diet:
    product = product.strip()
    if product in vitamin_c:
        total += vitamin_c[product]
