#
# Користувач вводить слово та індекс. Замініть символ під
# цим індексом на *. Скористайтесь зрізами
# Приклади:
# hello 1 – h*llo
# hello 2 – he*lo


# word = input("Введіть слово: ")
# index = int(input("Введіть індекс: "))
#
# chars = list(word)
# chars[index] = '*'
# result = ''.join(chars)
#
# print(result)


# Користувач вводить слово. Зробіть першу та останню
# літеру великою.


# word = input("Введіть слово: ")
#
# new_word = word[0].upper() + word[1:-1] + word[-1].upper()
# print(new_word)
#
# Завдання 3
# Користувач вводить слова, поки не введе END. Виведіть в
# кінці ті слова, які починаються і закінчуються на одну і ту
# саму літеру.
# Приклади: око, дід, Ротор, Ангора


#
# while True:
#     word = input("Введіть слово: ")
#     if word == "END":
#         break
#     elif word[0] == word[-1]:
#         print(word)
