# Напишіть гру Правда або Дія.
# Опис:
# 1. Спочатку, введіть імена гравців.
# 2. Кожен гравець по черзі обирає "Правда" або "Дія".
# 3. Якщо гравець обрав "Правда", йому задається
# запитання, на яке він повинен відповісти правдиво.
# 4. Якщо "Дія", гравець повинен виконати вказане
# завдання.
# 5. Після завершення кожного раунду, виведіть
# результати.
# Функції:
#  get_player_names(): Запитайте імена гравців і поверніть
# їх у вигляді списку.
#  ask_truth_or_dare(player): Функція, яка приймає ім'я
# гравця та запитує його, чи обирати "Правда" чи "Дія".
#  ask_truth_question(player): Функція, яка приймає ім'я
# гравця, виберє одне запитання випадковим чином та
# просить гравця дати відповідь.
#  perform_dare(player): Функція, яка приймає ім'я гравця
# та вибирає одне завдання випадковим чином та
# просить гравця виконаи його.
# Домашнє завдання
#  play_game(players): Функція, яка керує ходом гри.
# Послідовно запитайте кожного гравця, чи обирати
# "Правда" чи "Дія", а потім відповідно викликайте
# функцію ask_truth_question або perform_dare.
# Константи:
#  questions – список питань
#  dares – список завдань


# get_player_names(): Запитайте імена гравців і поверніть
# # їх у вигляді списку.


questions = []


def get_player_names():
    players = []

    for i in range(2):
        name = input(f"Гравець {i + 1}: ")
        players.append(name)

    while True:
        add_player = input("Хочете додати ще одного гравця? (так/ні): ")

        if add_player.lower() == "так":
            name = input(f"Гравець {len(players) + 1}: ")
            players.append(name)
        else:
            break

    return players


# print(get_player_names())
# ask_truth_or_dare(player): Функція, яка приймає ім'я
# гравця та запитує його, чи обирати "Правда" чи "Дія".


def ask_truth_or_dare(players):
    results = []

    for player in players:
        while True:
            choice = input(f"{player}, обери Правда або Дія: ").strip()

            if choice == "правда":
                results.append("Правда")
                break
            elif choice == "дія":
                results.append("Дія")
                break
            else:
                print("Будь ласка, введіть 'Правда' або 'Дія'")

    return results


result = ask_truth_or_dare()
print(result)

# Функція, яка приймає ім'я гравця
# # та вибирає одне завдання випадковим чином та
# # просить гравця виконаи його.
