# # Користувач вводить слова через пропуск а також
# # число N. Відсортуйте ці слова в алфавітному порядку та
# # виведіть перші N слів з відсортованого списку
#
#
# # N = int(input("Введіть число N: "))
# # word = (input("Введіть слова: ")).split()
# #
# # word_sorted = sorted(word)
# # print(word_sorted[:N])
#
#
#
# # Користувач вводить слова через пропуск. Добавте до
# # кожного слова @gmail.com та виведіть новий список слів
#
#
# # words = input("Введіть слова: ").split()
# # res = []
# # for word in words:
# #     res.append(word + "@gmail.com")
# #
# # print(res)
#
#
# Проводиться опитування. Користувачі можуть дати 5
# варіантів відповіді:
#  негативно
#  скоріше негативно
#  нейтрально
#  скоріше позитивно
#  позитивно
# Створіть 2 списки: з варіантами відповідями та
# кількостями відповідей на кожен варіант.
# Користувач вводить варіанти відповідей, поки не введе
# Домашнє завдання
# END
# Після чого виведіть статистику скільки людей як саме
# відповіли у форматі:
# 10 – негативно
# 27 – скоріше негативно

answers = [
    "негативно",
    "скоріше негативно",
    "нейтрально",
    "скоріше позитивно",
    "позитивно",
]
counts = [0, 0, 0, 0, 0]

while True:
    user_input = input("Введіть варіанти відповідей ").strip().lower()

    if user_input == "домашнє завдання":
        break

    if user_input == answers[0]:
        counts[0] += 1
    elif user_input == answers[1]:
        counts[1] += 1
    elif user_input == answers[2]:
        counts[2] += 1
    elif user_input == answers[3]:
        counts[3] += 1
    elif user_input == answers[4]:
        counts[4] += 1
    else:
        print("Помилка! Введіть один з варіантів.")

print("Статистика відповідей:")
print(counts[0], "– негативно")
print(counts[1], "– скоріше негативно")
print(counts[2], "– нейтрально")
print(counts[3], "– скоріше позитивно")
print(counts[4], "– позитивно")
